#!/usr/bin/env bash

./tuniclang.py \
    -so11100:æ \
    -so01100:ɒ \
    -so00011:ɪ \
    -so00111:e \
    -so00110:ʊ \
    -so11000:ə \
    \
    -so01111:i \
    -so11110:u \
    -so10111:əʳ \
    -so11101:ɔːʳ \
    -so11011:ɑːʳ \
    -so01101:ɪəʳ \
    \
    -so01000:eɪ \
    -so10000:aɪ \
    -so00010:ɔɪ \
    -so00001:aʊ \
    -so11111:əʊ \
    -so00101:eəʳ \
    \
    \
    -si000101:m \
    -si001101:n \
    -si111111:ŋ \
    -si100010:p \
    -si010001:b \
    -si101010:t \
    \
    -si010101:d \
    -si110001:k \
    -si100011:g \
    -si010100:dʒ \
    -si001010:tʃ \
    -si100110:f \
    \
    -si011001:v \
    -si111010:ˈð \
    -si010111:ð \
    -si110110:s \
    -si011011:z \
    -si101111:ʃ \
    \
    -si111101:ʒ \
    -si010011:h \
    -si110010:r \
    -si011010:j \
    -si101000:w \
    -si010010:l \
    \
    \
    "$@"

# /e//b//au//t/ ("about") (əˈbaʊt)
# /f//r//e//m/ ("from") (frəm)
# /e/v ("of") (əv)
# /g//r//ei//t/ (100011 110010:01000 101010) ("great") (ɡreɪt)
# /p//au//er/ (100010:00001 10111) ("power") (paʊəʳ)
# /s/ɪt/i/ (110110:00011 101010:01111) ("city") (sɪt.i)
# /e//n/d (11100:001101 010101) ("and") (ænd)
# /ł/ɪ/th/ɪ/n/ (101000:00011 111010:00011 001101) ("within") (wɪˈðɪn)
# /h//e/ld 010011:00111 010010 010101 "held" held
# v/e/n/cz/əʳd 011001:00111 001101 001010:10111 010101 "ventured" ven.tʃər
# /f//ar/ 100110:11011 "far" fɑːʳ
# /sh//or/ 101111:11101 "shore" ʃɔːʳ
# /ou/vəʳwəʳ/k/t 11111:011001 10111 101000:10111 110001 101010 "overworked" əʊ.vəˈwɜːkt
# f/u/l/k/rə/m/ 100110:00110 010010 110001 110010:11000 000101 "fulcrum" fʊl.krəm
# dɪs/k/w/ai/et 010101:00011 110110 110001 101000:10000 00111:101010 "disquiet" dɪˈskwaɪət
# /b/ɪlt 010001:00011 010010 101010 "built" bɪlt
# /j//u//ż//u/ʊl 011010:11110 111101:11110 00110:010010 "usual" juː.ʒu.əl
# əl/u/rɪ/ng/  11000:010010 11110:110010 00011:111111 "aluring" əˈlʊə.rɪŋ
# s/o/t 110110:01100 101010 "sought" sɔːt
# f/o/sʊl/s/ 100110:01100 110110:00110 010010 011011 "fossils" fɒs.əl
# kæn/o/nɪkʊl 110001:11100 001101:01100 001101:00011 110001:00110 010010 "canonical" kəˈnɒn.ɪ.kəl
# k/oi/l 110001:00010 010010 "coil" kɔɪl
# ɪ/s/ 00011:011011 "is" ɪz
# h/ere/ 010011:01101 "here" hɪəʳ

# TODO: finish english text on pages-3-7.txt
# TODO: translate all pages in booklet
# TODO: prepare orderly alphabet
